
tap "homebrew/bundle"

###############################
#     cli tools               #
###############################

# standard tools for cli
brew "bat"
brew "broot"
brew "btop"
brew "bottom"
brew "dasel"
brew "duckdb"
brew "dust"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "gtop"
brew "hexyl"
brew "htop"
brew "jq"
brew "make"
brew "ncdu"
brew "rclone"
brew "ripgrep"
brew "tldr"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"

# languages
brew "go"
brew "terraform"

# python tooling
brew "pipx"
brew "pyenv"

###############################
#     macOS Apps via Cask     #
###############################

cask_args appdir: "/Applications"

cask "arc"
cask "brave-browser"
cask "chatgpt"
cask "daisydisk"
cask 'discord'
cask "dropbox"
cask "docker"
cask "iterm2"
cask 'github'
cask "google-chrome"
cask "ledger-live"
cask "linear-linear"
cask "messenger"
cask "microsoft-office"
cask "notion"
cask "notion-calendar"
cask "postman"
cask "slack"
cask "signal"
cask "sublime-text"
cask "sublime-merge"
cask "steam"
cask "tad"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# vscode settings
vscode "github.copilot"
vscode "github.copilot-chat"
