
tap "homebrew/bundle"

###############################
#     cli tools               #
###############################

# standard tools for cli
# note existing tools are included in this list to ensure they are up to date

# shells
brew "bash"
brew "fish"
brew "zsh"

# general tools
brew "coreutils"
brew "dasel"
brew "direnv"
brew "duckdb"
brew "gcc"
brew "neovim"
brew "rename"
brew "rsync"
brew "shellcheck"
brew "tldr"
brew "tmux"
brew "watch"
brew "unzip"
brew "vim"
brew "xz"
brew "z"
brew "zip"

# file viewing tools
brew "bat"
brew "eza"
brew "hexyl"
brew "jq"

# filesystem search tools
brew "broot"
brew "dust"
brew "findutils"
brew "fd"
brew "fzf"
brew "ncdu"
brew "ranger"
brew "ripgrep"
brew "tree"

# network tools
brew "curl"
brew "httpie"
brew "mtr"
brew "nmap"
brew "openssh"
brew "openssl@3"
brew "rclone"
brew "telnet"
brew "wget"

# system monitoring / top alternatives
brew "btop"
brew "bottom"
brew "htop"
brew "glances"
brew "gtop"

# development tooling
brew "make"
brew "git"
brew "git-lfs"
brew "gh"

# languages
brew "go"
brew "lua"
brew "terraform"

# python tooling
brew "pipx"
brew "pyenv"

###############################
#     macOS Apps              #
###############################

# mac app store cli
brew "mas"

# via Cask

cask_args appdir: "/Applications"

# web browers
cask "arc"
cask "brave-browser"
cask "google-chrome"

# communication
cask 'discord'
cask "messenger"
cask "slack"
cask "signal"
cask "telegram"
cask "zoom"

# productivity & media
cask "chatgpt"
cask "dropbox"
cask "linear-linear"
cask "microsoft-office"
cask "notion"
cask "notion-calendar"
cask "steam"
cask "tad"
cask "vlc"

# development tools
cask "cursor"
cask "docker"
cask "iterm2"
cask "github"
cask "postman"
cask "sublime-text"
cask "sublime-merge"
cask "visual-studio-code"
# cloud
cask "google-cloud-sdk"
# raspberry pi
cask "raspberry-pi-imager"

# utilities
cask "apparency"
cask "cyberduck"
cask "daisydisk"
cask "keepingyouawake"
cask "ledger-live"
cask "rectangle"
cask "pearcleaner"
cask "protonvpn"
cask "raycast"
cask "stats"
cask "the-unarchiver"

###############################

# vscode settings
vscode "github.copilot"
vscode "github.copilot-chat"
