
tap "homebrew/bundle"

# standard tools for cli
brew "fzf"
brew "git"
brew "gh"
brew "htop"
brew "jq"
brew "tmux"
brew "tree"
brew "wget"
brew "make"
# languages
brew "go"
# python tooling
brew "pyenv"
brew "pipx"

###############################
#  macOS Apps via Cask        #
###############################

cask_args appdir: "/Applications"

cask "iterm2"
cask "docker"
cask "microsoft-office"
cask "google-chrome"
cask "slack"
cask "zoom"
cask "steam"
cask "the-unarchiver"
cask "visual-studio-code"

# vscode settings
vscode "github.copilot"
vscode "github.copilot-chat"
